#include <stdio.h>

// Упр.2.9
// Доказать, что в x &= (x - 1) удаляется самый правый бит
// написать bitcount

int bitcount(unsigned int x);

int main(void) {

	unsigned int x;

	x = 056; // 101110

	// x = x & (x - 1); // обнуляется последний бит
					 // 101110 - 000001 = 101100
					 // 101100 >> 1 = 010110
					 // 010110 - 000001 = 010100
					 // 010100 >> 1 = 001010
					 // 001010 - 000001 = 001000
					 // 001000 >> 1 = 000100
					 // 000100 - 000001 = 000000
					 // 000000 >> 1 = 0000000
					 
					 // 101100 = 54

	printf("%d\n", bitcount(x));
	
	return 0;
}

int bitcount(unsigned int x) {

	int count = 0;

	while (x != 0) {
		++count;
		// удаляем один крайний бит
		x = x & (x - 1);
		// сдвигаем
		x = x >> 1;
	}

	return count;
}
